//D12 JOB E,
 //            'D12',
 //             PRTY=12,
 //             CLASS=C,
 //             MSGCLASS=Y,
 //             USER=U99
 /*JOBPARM      L=900
 //APPLPROC JCLLIB ORDER=('F.PROCLIB','P.PROCLIB')
 //***********************************************
 //*
 //J10 EXEC M120,
 //            CTL='P',
 //            RGN='''V30,V31,V32''',
 //            SYSID='R01'
 //
